export default {
  hero: {
    audio: {
      attack: {
        path: './../src/audio/player_attack.mp3',
      },
      demage: {
        path: './../src/audio/player_damage.mp3',
      },
      healing: {
        path: './../src/audio/player_heal.wav',
      },
    },
    sprites: {
      legRight: {
        path: './../src/img/hero/legs/leg-right.png',
        options: {
          width: 76,
          height: 86,
          x: 50,
          y: 510,
        },
      },
      legLeft: {
        path: './../src/img/hero/legs/leg-left.png',
        options: {
          width: 76,
          height: 86,
          x: 120,
          y: 510,
        },
      },
      handLeft: {
        path: './../src/img/hero/hands/hand-left.png',
        options: {
          width: 158,
          height: 170,
          x: 140,
          y: 335,
        },
      },
      body: {
        path: './../src/img/hero/body/body.png',
        options: {
          width: 190,
          height: 186,
          x: 0,
          y: 350,
        },
      },
      head: {
        path: './../src/img/hero/head/head.png',
        options: {
          width: 188,
          height: 184,
          x: 30,
          y: 235,
        },
      },
      handRight: {
        path: './../src/img/hero/hands/hand-right.png',
        options: {
          width: 74,
          height: 124,
          x: 30,
          y: 405,
        },
      },

    },
  },

  monster: {
    name_1: ['Шкурочафк', 'Могилогной', 'Адорыш', 'Адогной', 'Чернодемон', 'Могилочервь', 'Хмурорыш', 'Черночафк', 'Дуборыш', 'Злослон', 'Огнедемон', 'Хмурочервь', 'Демонотрон', 'Краснотрон', 'Хмурогной', 'Шкурокоп', 'Могилочерт', 'Могилохрум', 'Некрослон', 'Воздухомет', 'Землекол', 'Светорез', 'Дубинозавр', 'Светомонстр', 'Булавотерз', 'Ножетерз', 'Водозавр', 'Топоробур', 'Молотобур', 'Черепомаг', 'Астралокид', 'Светобур', 'Воздухорез', 'Копьебур', 'Экспокид', 'Астраломаг', 'Черепотык', 'Ножебур', 'Мечебур', 'Плотокол', 'Темнокол', 'Плотоед', 'Головолом', 'Булавотерз', 'Копьелом', 'Астралокид', 'Землемах', 'Темнобур', 'Молотозавр', 'Некродемон', 'Мегаужас', 'Шкуромерз', 'Некроцап', 'Рогокоп', 'Плотомаг', 'Костемонстр', 'Костелом', 'Экспокид', 'Темнорез', 'Астралобур', 'Плотокол', 'Топоротерз', 'Палицомаг', 'Костелом', 'Дубинотык', 'Пикомаг', 'Пикотерз', 'Огнекид', 'Мечелом', 'Палицомаг', 'Плотобур', 'Светотерз', 'Копьебур', 'Палицозавр', 'Водомонстр', 'Молотомах', 'Мечемаг', 'Пикомах', 'Молотомонстр', 'Палицолом', 'Копьетык', 'Костебур', 'Головотык', 'Темнолом', 'Демоноужас', 'Мегаед', 'Злослон', 'Могилодемон', 'Некротрон', 'Дуборыш', 'Шкуроцап', 'Смерточафк', 'Рогогной', 'Мегачервь', 'Рогозавр', 'Хмурослон', 'Огнецап', 'Злокоп', 'Роготрон', 'Адопуз', 'Хмуродемон', 'Бякокоп', 'Смертозавр', 'Рогохрум', 'Огнедемон', 'Адослон', 'Чернорыш', 'Адогной', 'Бякохрум', 'Демонохрум', 'Кровомерз', 'Дуботруп', 'Кроворыш', 'Грязетрон', 'Бякоужас', 'Кровоцап', 'Демонотрон', 'Адочерт', 'Кровослон', 'Бякохрум'],
    name_2: ['Движухаотик', 'Светохаос', 'Килотрон', 'Коксотрон', 'Вспыходрыг', 'Яркотрой', 'Неотрой', 'Криотрой', 'Гиперслон', 'Гексоглюк', 'Неотрон', 'Гипертаракан', 'Битотрон', 'Килотаракан', 'Психомуха', 'Трансвирус', 'Коксоноль', 'Цифрозомби', 'Роботаракан', 'Гамманоль', 'Бетасталкер', 'Гаммахаотик', 'Мегавирус', 'Робосталкер', 'Темноглюк', 'Яркотаракан', 'Технокрыл', 'Коксобаг', 'Робозомби', 'Килохаос', 'Трансмуха', 'Килокрыл', 'Диждикрыл', 'Роботрой', 'Рободрыг', 'Киломуха', 'Гексохаотик', 'Гаммаснег', 'Битокрыл', 'Терраслон', 'Коксослон', 'Террахаотик', 'Робослон', 'Психолёт', 'Цифроплыв', 'Альфазомби', 'Бетатаракан', 'Движудрыг', 'Гексоноль', 'Трансглюк', 'Терратрой', 'Гексослон', 'Роботаракан', 'Диждиглюк', 'Битовирус', 'Психотрой', 'Темнозомби', 'Рободрыг', 'Светохаос', 'Вспыхотрон', 'Светохаотик', 'Битотрой', 'Бетабаг', 'Ярконоль', 'Вспыхотрой', 'Рободрыг', 'Гамматрон', 'Светокрыл', 'Бетадрыг', 'Психоновик', 'Психовирус', 'Трансзомби', 'Движуснег', 'Трансвирус', 'Битодрыг', 'Темнохаотик', 'Дельтасталкер', 'Робобаг', 'Движуслон', 'Темнохаотик', 'Гаммадрыг', 'Криобаг', 'Движуновик', 'Бетановик', 'Психоснег', 'Неоплыв', 'Темноновик', 'Бетатрой', 'Гаммалёт', 'Вспыхомуха'],
    name_3: ['Гыгышный', 'Аццкый', 'Пафассный', 'Гламурный', 'Нимецкая', 'Газенвагенскый', 'Пафассный', 'Миталлюгскый', 'Ржачный', 'Падонкаффский', 'Йадовитый', 'Пятибальный', 'Лольный', 'Имошный', 'Анимэшный', 'Албанский', 'Онглискый', 'Ипаццкый', 'Сапожный', 'Онглиский', 'Злобный', 'Сопливый', 'Ужасный', 'Мерзкий', 'Зеленый', 'Плановый', 'Фиолетовый', 'Укуренный', 'Косяковый', 'Оранжевый', 'Косячный', 'Aгрессивный', 'Aзартный', 'Aморальный', 'Безумный', 'Жадный', 'Железный', 'Злой', 'Занудный', 'Коварный', 'Ловкий', 'Наглый', 'Медлительный', 'Осторожный', 'Подозрительный', 'Сумашедший', 'Твердолобы', 'Тупой', 'Тресливый', 'Угрюмый', 'Холодный', 'Цельнометаллический', 'Юродивый', 'Мутный', 'Ловкий', 'Одноглазый', 'Быстрый', 'Пьяный', 'Смертоносный', 'Ловкий', 'Танцующий', 'Черный', 'Дерзкий', 'Бесшумный', 'Ирладский', 'Бешеный ', 'Меткий'],
    audio: {
      attack: {
        path: './../src/audio/monster_attack.wav',
      },
      demage: {
        path: './../src/audio/monster_damage.mp3',
      },
    },
    sprites: {
      handLeft: {
        path: ['./../src/img/monster/hands/hand-1/hand-left.png', './../src/img/monster/hands/hand-2/hand-left.png', './../src/img/monster/hands/hand-3/hand-left.png'],
        options: {
          width: 150,
          height: 70,
          x: 920,
          y: 285,
        },
      },
      body: {
        path: ['./../src/img/monster/body/body-1/body.png', './../src/img/monster/body/body-2/body.png', './../src/img/monster/body/body-3/body.png'],
        options: {
          width: 110,
          height: 177,
          x: 1015,
          y: 295,
        },
      },
      head: {
        path: ['./../src/img/monster/head/head-1/head1.png', './../src/img/monster/head/head-2/head1.png', './../src/img/monster/head/head-3/head1.png'],
        setOfPath: [['./../src/img/monster/head/head-1/head1.png', './../src/img/monster/head/head-1/head2.png', './../src/img/monster/head/head-1/head3.png'],
          ['./../src/img/monster/head/head-2/head1.png', './../src/img/monster/head/head-2/head2.png', './../src/img/monster/head/head-2/head3.png'],
          ['./../src/img/monster/head/head-3/head1.png', './../src/img/monster/head/head-3/head2.png', './../src/img/monster/head/head-3/head3.png']],
        options: {
          width: 185,
          height: 164,
          x: 1000,
          y: 170,
        },
      },
      handRight: {
        path: ['./../src/img/monster/hands/hand-1/hand-right.png', './../src/img/monster/hands/hand-2/hand-right.png', './../src/img/monster/hands/hand-3/hand-right.png'],
        options: {
          width: 150,
          height: 70,
          x: 965,
          y: 340,
        },
      },
      legRight: {
        path: ['./../src/img/monster/legs/leg-1/leg-right.png', './../src/img/monster/legs/leg-2/leg-right.png', './../src/img/monster/legs/leg-2/leg-right.png'],
        options: {
          width: 79,
          height: 183,
          x: 975,
          y: 415,
        },
      },
      legLeft: {
        path: ['./../src/img/monster/legs/leg-1/leg-left.png', './../src/img/monster/legs/leg-2/leg-left.png', './../src/img/monster/legs/leg-3/leg-left.png'],
        options: {
          width: 79,
          height: 183,
          x: 1055,
          y: 415,
        },
      },
    },
  },
};
